[
    {
        "id": "1",
        "title": "Sandglo Glass",
        "img": "/img/portfolio-01.jpg",
        "altImg": "Sandglo Glass website on a laptop and mobile device",
        "imgDetail": "/img/portfolio-details-01.jpg",
        "altImgDetail": "Some of the work that Sandglo is capable of",
        "desc": "UI/UX and Front-end",
        "p1": "Sandglo glass had a problem with not having a responsive website to meet the needs of their mobile customers. I was able to meet with the stakeholders of the company where we spent time talking about their needs which included rich multimedia showing detail in the sandblasted glass designs, showcasing the business work that they continue to do in downtown Cleveland, and a place where people can express interest in a career.",
        "p2": "Once I had the expectations of the client I began working on a mood board and style tiles that would serve as the basis to some of the components of the website. I used these to create a mock-up design in Photoshop. The client was happy with the design and gave me the ok to start building out in the browser.",
        "p3": "To build out the site I decided to work with Foundation as the framework. I also utilized Sass for the styles and manipulating the layout to conform to the photoshop mock. I also used PHP to make the site modular and to validate the contact form.",
        "link": "http://sandgloglass.com/"
    },

    {
        "id": "2",
        "title": "1st Impressions",
        "img": "/img/portfolio-02.jpg",
        "altImg": "1st Impressions landscape website on laptop computer",
        "imgDetail": "/img/portfolio-details-02.jpg",
        "altImgDetail": "The link to 1st Impressions WordPress Blog",
        "desc": "UI/UX, WordPress, and Front-end",
        "p1": "This client came to me with a need for a way to communicate their projects and a simple way to post them. They also wanted a way to increase their site traffic. We decided that the best way for them to do this was to create a WordPress site.",
        "p2": "The work began with a complete mock-up of the UI. Also, I started framing up a custom WordPress site that I implemented Foundation as a framework for ease of use and future upgradeability. I also used Sass on this project to build up the UI and make it look like the mock-up",
        "p3": "Overall the project showcased knowledge of PHP, framing up the WordPress theme. The client was excited to have a site that they could update with their own content management system.",
        "link": "https://1stimpressionsohio.com"
    },

    {
        "id": "3",
        "title": "JanDell Flowers",
        "img": "/img/portfolio-03.jpg",
        "altImg": "Jandell Flower's website on a laptop and mobile device",
        "imgDetail": "/img/portfolio-details-03.jpg",
        "altImgDetail": "Product page with all of the bouquets displayed",
        "desc": "UI/UX and Front-end",
        "p1": "When JanDell contacted me they were looking for a modern design and something that would work on mobile devices. The following results are what we collaborated on to bring their identity to life. The client was on a short timeline and we were able to put this redesign together in less than a month.",
        "p2": "This project was a pretty straight forward build. To expedite the process I started designing in the browser first. Due to the short timeline I felt it was the best way to proceed with the project and get it done quickly. We created a live test server for the client to check into every week.",
        "p3": "I used JavaScript, Sass, and Foundation to build out the site. The flower page was built with JavaScript to make the cool hover effects on the products. Sass was used to work modularly on the styles and Foundation for easy maintenance.",
        "link": "https://www.jandellflowers.com/"
    },
    
    {
        "id": "4",
        "title": "Ahern Catering",
        "img": "/img/portfolio-04.jpg",
        "altImg": "Ahern Catering website on laptop computer",
        "imgDetail": "/img/portfolio-details-04.jpg",
        "altImgDetail": "A sample of some of the catering they offer",
        "desc": "UI/UX and Front-end",
        "p1": "This was a fun project for a catering company in Northeast Ohio. They had a concentration on Wedding catering and also owned some of the Halls that they would rent for special occasions. They wanted something that would work on mobile as well as an emmersive dive into what services the provide.",
        "p2": "This project was started with multiple client meetings and brain storming sessions. I created multiple mock-ups for these meetings along with color swatches and style tiles. To make the site more immersive we decided on a nice image slider to span the width of the screen to show off some of the events.",
        "p3": "The site was built out using Foundation, Sass, JQuery, and JavaScript. It was a fun build and a great client to work with.",
        "link": "https://www.aherncatering.com/"
    },

    {
        "id": "5",
        "title": "Mileti Optical",
        "img": "/img/portfolio-05.jpg",
        "altImg": "Mileti Optical website on laptop and mobile device",
        "imgDetail": "/img/portfolio-details-05.jpg",
        "altImgDetail": "A laptop displaying some of the hearing aids that are offered at Mileti",
        "desc": "UI/UX and Front-end",
        "p1": "This client was in need of web design help and had a short timeframe. They wanted a mobile site and a way for them to display coupons for the products they provided. We spoke on the phone multiple times due to our schedules not lining up. We were able to make a test server so that as we were communicating they could see the progress.",
        "p2": "To keep this project on task it was designed in the browser. To rapidly get it setup Foundation was used as a building block. All styles were done using Sass and a slider was added to display hearing aid content images. The coupon layouts where done in Foundation callout boxes to allow them to pop out.",
        "p3": "The client was happy with the progress and the way the site turned out. They continue to add additional coupons and products.",
        "link": "https://www.miletioptical.com/"
    },

    {
        "id": "6",
        "title": "Skybryte",
        "img": "/img/portfolio-06.jpg",
        "altImg": "Skybryte website on all in one computer",
        "imgDetail": "/img/portfolio-details-06.jpg",
        "altImgDetail": "Showing a linked Google map to find the location of Skybryte",
        "desc": "UI/UX and Front-end",
        "p1": "This project was a ground up build. All they had were Safety Data Sheets and some old images of bottles they used for online sales. It allowed me to brush up on my Illustrator skills to create all the icons and images on the site.",
        "p2": "The website was a very straight forward build using Foundation and Sass. All of the assets were created by me through Illustrator. I integrated Google maps so that customers can find the shop to purchase their products.",
        "p3": "The client was happy with the result and excited they had a new responsive website. It was a great feeling creating a clients online presence!",
        "link": "https://skybryte.com/"
    },

    {
        "id": "7",
        "title": "Front End Libraries",
        "img": "/img/portfolio-07.jpg",
        "altImg": "Collection of apps created with React",
        "imgDetail": "/img/portfolio-details-07.jpg",
        "altImgDetail": "Close-up of apps created for projects",
        "desc": "React.js",
        "p1": "This collection of projects were for Free Code Camp's Front End Library certification. This was a fantastic learning experience because it stretched the basic foundation of what had been taught in there program. With some additional research I was able to build upon the basics, using hooks and context to create these projects.",
        "p2": "The first project was a Markdown Previewer which takes Github flavored markdown and converts it to HTML. Second, the Drum Machine project. This worked through keyboard, mouse events, and HTML's audio property. The JavaScript calculator was quite difficult to create all of the different math logic and finish all of the user stories. I did have a lot of fun creating the old style calculator look! Lastly, the Pomodoro clock which will allow you to set a timer and a break timer. There is also an audible alert to let you know the timer is done.",
        "p3": "All of these projects and the code that was used can be previewed via Codepen.",
        "link": "https://codepen.io/collection/AaVrMo"
    },
    
    {
        "id": "8",
        "title": "Data Visualizations",
        "img": "/img/portfolio-08.jpg",
        "altImg": "Data Visualization pens via Codepen",
        "imgDetail": "/img/portfolio-details-08.jpg",
        "altImgDetail": "Data Visualization of US GDP, Doping in Pro Bicycle Racing, Land Surface Temperature, Educational Attainment, and Movie Sales",
        "desc": "D3.js",
        "p1": "These Projects were part of the Free Code Camp curriculum on Data Visualization. They used D3 which is a JavaScript library dedicated to displaying data graphically.",
        "p2": "There are five projects that were completed to obtain the Certification for Data Visualiztion. They were a bar chart, scatterplot graph, heat map, choropleth map, and a treemap.",
        "p3": "These were great projects and pushed me to learn a new library. They dived deep into SVG and how to manipulate them with the D3.js API. I think the results speak for themselves.",
        "link": "https://codepen.io/collection/nqVrdb"
    },

    {
        "id": "9",
        "title": "PicSome",
        "img": "/img/portfolio-09.jpg",
        "altImg": "Picsome project on all in one computer",
        "imgDetail": "/img/portfolio-details-09.jpg",
        "altImgDetail": "",
        "desc": "React.js",
        "p1": "This was a capstone project that I completed in my React Bootcamp. It is a photo based app that you can select photos, favorite them, add them to a cart, and then buy them.",
        "p2": "While building the project it went through different facets of React starting with JSX, functional components, hooks, custom hooks, context, and React Router. I really enjoyed the development process and seeing this project come to life." ,
        "p3": "The rest of the site was built out using CSS and bringing in the photos from a github repository along with icons from remixicon.",
        "link": ""
    }
]